; domain
(define (domain coffee-shop)

  ;; define types
  (:types
    robot customer table barcounter
    drink
    cold-drink - drink
    warm-drink - drink)

  ;; define constants
  (:constants
    barista - robot1
    waiter - robot2
    cold-drink - cold-drink
    warm-drink - warm-drink
    table-1 - table
    table-2 - table
    table-3 - table
    table-4 - table
    main - barcounter)

  ;; define predicates
  (:predicates
    (order-placed ?c - customer ?d - drink)
    (drink-ready ?d - drink)
    (drink-served ?c - customer ?d - drink ?t - table)
    (tray-in-use)
    (tray-with-drinks)
    (cleaned ?t - table))

  ;; define cost function
  (:functions
    (total-cost))

  ;; define actions
  (:action prepare-cold-drink
    :parameters (?b - robot1 ?d - cold-drink )
    :precondition (and (not (drink-ready ?d))
                       (not (tray-in-use)) )
    :effect (and (drink-ready ?d)
                 (increase (total-cost) 1)))

  (:action prepare-warm-drink
    :parameters (?b - robot1 ?d - warm-drink)
    :precondition (and (not (drink-ready ?d))
                       (not (tray-in-use)))
    :effect (and (drink-ready ?d)
                 (increase (total-cost) 2)))

  (:action pickup-drink
    :parameters (?w - robot2 ?d - drink) 
    :precondition (and (drink-ready ?d)
                       (not (tray-in-use)))
    :effect (and (not (drink-ready ?d))
                      (tray-with-drinks)
                 (increase (total-cost) 1)))

  (:action pickup-tray
    :parameters (?w - robot2 ?m - table)
    :precondition (and (not (tray-in-use))
                       )
    :effect (and (tray-in-use)
                 (increase (total-cost) 1)))

  (:action pick-serve-return
    :parameters (?b - robot1 ?w - robot2 ?c - customer ?d - drink ?t - table ?m - barcounter )
    :precondition (and (not (drink-served ?c ?d ?t))
                       (drink-ready ?d)
                       (tray-with-drinks))
    :effect (and (drink-served ?c ?d ?t)
                 (not (drink-ready ?d))
                 (not (tray-with-drinks))
                 (increase (total-cost) 3)))
                 
   

  (:action clean-table
   :parameters (?w - robot2 ?t - table)
   :precondition (not (cleaned ?t))
   :effect (and (cleaned ?t)
                (increase (total-cost) 1))))

; problem
(define (problem coffee-shop-2)
  (:domain coffee-shop)

  (:objects
    c1 - customer
    c2 - customer
    c3 - customer
    c4 - customer
    cold-drink1 - cold-drink
    cold-drink2 - cold-drink
    warm-drink1 - warm-drink
    warm-drink2 - warm-drink
    table-1 - table
    table-3 - table)

  (:init
    (order-placed c1 cold-drink1)
    (order-placed c2 cold-drink2)
    (order-placed c3 warm-drink1)
    (order-placed c4 warm-drink2)
     
    (not (tray-in-use))
    (not (tray-with-drinks))
  
      (= (total-cost) 0))
 

  (:goal
    (and
      (drink-served c1 cold-drink1 table-3)
      (drink-served c2 cold-drink2 table-3)
      (drink-served c3 warm-drink1 table-3)
      (drink-served c4 warm-drink2 table-3)
      (cleaned table-1)))
      
       (:metric minimize (total-cost)))

; plan
1. (clean-table waiter table-1)
   added: (cleaned table-1)
   goals met: 1 of 5
2. (prepare-cold-drink barista cold-drink1)
   added: (drink-ready cold-drink1)
   goals met: 1 of 5
3. (prepare-cold-drink barista cold-drink)
   added: (drink-ready cold-drink)
   goals met: 1 of 5
4. (prepare-cold-drink barista cold-drink2)
   added: (drink-ready cold-drink2)
   goals met: 1 of 5
5. (prepare-warm-drink barista warm-drink2)
   added: (drink-ready warm-drink2)
   goals met: 1 of 5
6. (prepare-warm-drink barista warm-drink1)
   added: (drink-ready warm-drink1)
   goals met: 1 of 5
7. (pickup-drink waiter cold-drink2)
   deleted: (drink-ready cold-drink2)
   added: (tray-with-drinks)
   goals met: 1 of 5
8. (prepare-cold-drink barista cold-drink2)
   added: (drink-ready cold-drink2)
   goals met: 1 of 5
9. (pick-serve-return barista waiter c2 cold-drink2 table-3 main)
   deleted: (drink-ready cold-drink2) (tray-with-drinks)
   added: (drink-served c2 cold-drink2 table-3)
   goals met: 2 of 5
10. (pickup-drink waiter warm-drink2)
   deleted: (drink-ready warm-drink2)
   added: (tray-with-drinks)
   goals met: 2 of 5
11. (prepare-warm-drink barista warm-drink2)
   added: (drink-ready warm-drink2)
   goals met: 2 of 5
12. (pick-serve-return barista waiter c4 warm-drink2 table-3 main)
   deleted: (drink-ready warm-drink2) (tray-with-drinks)
   added: (drink-served c4 warm-drink2 table-3)
   goals met: 3 of 5
13. (pickup-drink waiter warm-drink1)
   deleted: (drink-ready warm-drink1)
   added: (tray-with-drinks)
   goals met: 3 of 5
14. (prepare-warm-drink barista warm-drink1)
   added: (drink-ready warm-drink1)
   goals met: 3 of 5
15. (pick-serve-return barista waiter c3 warm-drink1 table-3 main)
   deleted: (drink-ready warm-drink1) (tray-with-drinks)
   added: (drink-served c3 warm-drink1 table-3)
   goals met: 4 of 5
16. (pickup-drink waiter cold-drink)
   deleted: (drink-ready cold-drink)
   added: (tray-with-drinks)
   goals met: 4 of 5
17. (pick-serve-return barista waiter c1 cold-drink1 table-3 main)
   deleted: (drink-ready cold-drink1) (tray-with-drinks)
   added: (drink-served c1 cold-drink1 table-3)
   goals met: 5 of 5
